config.org
#+TITLE: Doom emacs config
#+STARTUP: overview
#+PROPERTY: header-args :comment org :results silent :tangle yes
* Doom
#+begin_src emacs-lisp :tangle yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

Place your private configuration here! Remember, you do not need to run 'doom
sync' after modifying this file!


Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets.
#+begin_src emacs-lisp :tangle yes
(setq user-full-name "Mathias Nielsen"
      user-mail-address "john@doe.com")

;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
(setq doom-font (font-spec :family "Hasklig" :size 14))
(setq doom-variable-pitch-font (font-spec :family "Verdana" :size 12))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;;(setq doom-theme 'doom-palenight)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)


;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c g k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c g d') to jump to their definition and see how
;; they are implemented.

#+end_src

#+begin_src emacs-lisp :tangle yes
(setq doom-localleader-key ","
      doom-localleader-alt-key "M-,")
#+end_src
* Server mode

Add some bindings for server manipulation
#+begin_src emacs-lisp :tangle yes :results silent
(map!
 :leader
 :prefix ("S" . "server")
 :desc "Start server" "s" 'server-start
 :desc "Edit server" "e" 'server-edit
 :desc "Delete server" "x" 'server-force-stop
 )
#+end_src

Add hook to create new frame

#+begin_src emacs-lisp :tangle yes
(remove-hook 'server-visit-hook #'make-frame)
#+end_src
* OSX

#+begin_src emacs-lisp :tangle yes :results silent
(if (eq system-type 'darwin)
  ; something for OS X if true
  ; optional something if not
    (setq mac-command-modifier 'meta
          mac-option-modifier 'option)
)
#+end_src

* UI
** Default Frame size
#+begin_src emacs-lisp :tangle yes
(pushnew! default-frame-alist '(height . 40) '(width . 128))
#+end_src
** Theme
#+begin_src emacs-lisp :tangle yes
(load-theme 'doom-palenight)
#+end_src
* Evil
** Evil
#+begin_src emacs-lisp :tangle yes
(map!
 :after evil
 :n "TAB" #'evil-toggle-fold)
#+end_src

** Evil-org

#+begin_src emacs-lisp :tangle yes :results silent
(use-package! evil-org
  :defer t
  :after org
  :config
  (evil-org-set-key-theme '(navigation insert textobjects return todo additional calendar)))
#+end_src

*** Bindings :bindings:
#+begin_src emacs-lisp :tangle yes
  (map!
   :after org
   :map org-mode-map
   ;; Map RET to open-at-point
   :n "RET" #'org-open-at-point
   ;; Navigate Visible headings
   :n "J" #'org-next-visible-heading
   :n "K" #'org-previous-visible-heading
   :n "L" #'org-show-subtree
   :n "H" #'org-cycle)
#+end_src
* Outlook
#+begin_src emacs-lisp :tangle yes
(use-package! outlookedit
  :defer t
  :commands mno-edit-outlook-message mno-put-outlook-message
  :config (setq mno-get-outlook-body (concat "cscript //Job:getMessage " (expand-file-name "~//bin//outlook_emacs.wsf"))
                mno-put-outlook-body (concat "cscript //Job:putMessage " (expand-file-name "~//bin//outlook_emacs.wsf"))))
#+end_src
** Bindings :bindings:
#+begin_src emacs-lisp :tangle yes
(map!
 :after outlookedit
 :leader
 :prefix ("oo" . "Outlook")
 :desc "Edit" "e" #'mno-edit-outlook-message
 :desc "Save" "s" #'mno-put-outlook-message)
#+end_src
* Modes
** nxml
#+begin_src emacs-lisp :tangle yes
(use-package! nxml-mode
  :defer t
  :mode ("\\.xml$" . nxml-mode)
  :init
  :config
  (setq nxml-auto-insert-xml-declaration-flag nil)
  (set-file-template! 'nxml-mode)
  )

(after! org
  (pushnew! +org-babel-mode-alist '(xml . nxml)))
#+end_src

** org :org:
*** General Setup
**** Inital setup
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-log-done 'time
        org-log-into-drawer t
        org-startup-folded nil))
#+end_src
**** Todo-keywords
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-todo-keywords
      '((sequence "TODO(t)" "STARTED(s!)" "|" "DONE(d!)")
        (sequence "WAITING(w!)" "|")
        (sequence "|" "CANCELLED(C!)")
        (sequence "ACTIVE(a)" "ON-HOLD(h@!)" "|" "COMPLETED(c!)")))

(setq org-treat-S-cursor-todo-selection-as-state-change nil))
#+end_src

Set todo keyword faces
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-todo-keyword-faces
    '(("TODO" . (t (:inherit org-todo)))
      ;;("STARTED" . (t (:inherit org-todo :foreground "green")))
      (("COMPLETED" "DONE") . (t (:inherit org-done :strike-through t)))
      ("ON-HOLD" . "orange"))))
#+end_src

**** Priorities
Set pritories ranging from A to D

| Priority | Description                         |
| A        | Tasks that are urgent and important |
| B        |                                     |
| C        |                                     |
| D        |                                     |

#+begin_src emacs-lisp :tangle yes
(setq org-priority-highest ?A
      org-priority-lowest ?D
      org-priority-default ?B)
#+end_src

**** Effort
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-global-properties '(("Effort_ALL" . "0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00")
                                "StoryPoints" . "1 2 3 5 8 13 20 40 100")
        org-columns-default-format "%40ITEM(Task) %3StoryPoints(SP){:} %17Effort(Estimated Effort){:} %CLOCKSUM"))
#+end_src
**** Capture templates
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-capture-templates
        '(("t" "Todo" entry (file+headline "~/org/inbox.org" "Inbox")
           "* TODO [#C] %?")
          ("u" "Urgent Todo" entry (file+headline "~/org/gtd.org" "Misc")
           "* TODO [#A] %?"
           :jump-to-captured t)
          ("p" "Project" entry (file+headline "~/org/gtd.org" "Misc")
          "* ACTIVE %? [%] :project:")
          ("i" "Tickler" entry (file+olp+datetree "~/org/tickler.org")
           "* %?")
          ("l" "link" plain (file "~/org/links.org")
           "[[%^{Link}][%^{Description}]]")
          )))
#+end_src
**** Tags
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-tag-alist '(
                        (:startgroup . nil)
                        ("@localpc" . ?l) ("@devpc" . ?d) ("@rqm" . ?r) ("@emacs" . ?e)
                        (:endgroup .nil)
                        (:newline . nil)
                        ("project" . ?p) ("noexport" . ?n))))
#+end_src

*** UI :ui:
**** Faces
Taken from [[https://zzamboni.org/post/beautifying-org-mode-in-emacs/]]

#+begin_src emacs-lisp :tangle yes
(after! org
  (let* ((variable-tuple
        (cond ((x-list-fonts "Source Sans Pro") '(:font "Source Sans Pro"))
              ((x-list-fonts "Lucida Grande")   '(:font "Lucida Grande"))
              ((x-list-fonts "Verdana")         '(:font "Verdana"))
              ((x-family-fonts "Sans Serif")    '(:family "Sans Serif"))
              (nil (warn "Cannot find a Sans Serif Font.  Install Source Sans Pro."))))
       (base-font-color     (face-foreground 'default nil 'default))
       (headline           `(:inherit default :weight normal :foreground ,base-font-color)))

  (custom-theme-set-faces
   'user
   `(org-link ((t (:foreground ,base-font-color :underline t))))
   `(org-list-dt ((t (:foreground ,base-font-color :weight bold))))
   `(org-level-8 ((t (,@headline))))
   `(org-level-7 ((t (,@headline))))
   `(org-level-6 ((t (,@headline))))
   `(org-level-5 ((t (,@headline))))
   `(org-level-4 ((t (,@headline :height 1.0))))
   `(org-level-3 ((t (,@headline :height 1.0))))
   `(org-level-2 ((t (,@headline :height 1.0))))
   `(org-level-1 ((t (,@headline :height 1.2 :weight bold))))
   `(org-document-title ((t (,@headline :height 1.5 :underline nil :weight bold)))))))
#+end_src

