config.el

(use-package! org-superstar
  :defer t)

(use-package! org-pomodoro
  :defer t
  :config
  (setq org-pomodoro-audio-player (executable-find "vlc.exe"))
  )

  (setq org-agenda-files (list "~/org/gtd.org"))

  (setq org-stuck-projects '("+PROJECT" ("TODO" "NEXT") nil ""))

  (setq org-agenda-window-setup 'current-window)
  ;;(add-hook 'evil-org-agenda-mode-hook #'org-super-agenda-mode)
  ;;(setq org-super-agenda-header-map (make-sparse-keymap))

  (setq org-agenda-start-on-weekday nil
        org-agenda-span 10
        org-agenda-start-day "0d")

  ;; Speed up org-agenda
  ;;
  (setq org-agenda-inhibit-startup t
        org-agenda-dim-blocked-tasks nil
        org-use-tag-inheritance nil
        org-agenda-use-tag-inheritance nil)

(use-package! org-super-agenda
  :defer t
  :after evil-org
  :config
  (add-hook 'evil-org-agenda-mode-hook #'org-super-agenda-mode))

(after! org
  (setq org-agenda-custom-commands nil))

(defmacro +mnie/add-org-agenda-custom-commands (&rest command)
  "Add new COMMAND to org-agenda-custom-commands sequentially"
  (let ((var (make-symbol "result")))
    `(dolist (,var (list ,@command) nil)
       (after! org (add-to-list 'org-agenda-custom-commands ,var)))))

(+mnie/add-org-agenda-custom-commands
               '("n" "Next Actions"
                  ((agenda "" ((org-agenda-overriding-header "Today")
                               (org-agenda-span 'day)))
                   (alltodo "" ((org-agenda-overriding-header "On-going Tasks")
                                                 (org-agenda-skip-function '(or (org-agenda-skip-entry-if 'todo '("WAITING"))
                                                                                (org-agenda-skip-subtree-if 'todo '("ON-HOLD"))
                                                                                (org-agenda-skip-entry-if 'regexp ":project:")
                                                                                (org-agenda-skip-entry-if 'notregexp "CLOCK:")))))
                   (tags-todo "+PRIORITY=\"A\"" ((org-agenda-overriding-header "High Priority")
                                                 ))
                   (tags-todo "PRIORITY=\"B\"|PRIORITY=\"C\"" ((org-agenda-overriding-header "Medium Priority")
                                                               (org-agenda-sorting-strategy '(priority-down))
                                                               )))
                  ((org-agenda-skip-function '(or (org-agenda-skip-entry-if 'todo '("STARTED" "WAITING"))
                                                  (org-agenda-skip-subtree-if 'todo '("ON-HOLD"))
                                                  (org-agenda-skip-entry-if 'regexp ":project:")
                                                  (org-agenda-skip-entry-if 'regexp "CLOCK:"))))))

(+mnie/add-org-agenda-custom-commands  '("c" . "Contexts")
                                       '("cl" "@localpc" tags-todo "@localpc")
                                       '("cd" "@devpc" tags-todo "@devpc")
                                       '("cr" "@rqm" tags-todo "@rqm")
                                       '("ce" "@emacs" tags-todo "@emacs"))

(after! org
  (add-to-list 'org-agenda-custom-commands '("r" . "Review") t))

(after! org
  (add-to-list 'org-agenda-custom-commands
               '("rd" "Daily Review"
                 ((todo "" ((org-agenda-overriding-header "Inbox")
                            (org-agenda-files (list (expand-file-name "inbox.org" org-directory)))))
                  (todo "" ((org-agenda-overriding-header "Process")
                            (org-agenda-skip-function '(or (org-agenda-skip-entry-if 'regexp ":project:")
                                                           (and (org-agenda-skip-entry-if 'regexp ":@\\w+:"))))))
                  (tags-todo "refine" ((org-agenda-overriding-header "Refine")))))))

(after! org
  (setq org-agenda-prefix-format '((agenda . " %-1i %?-12t% s")
                                (todo . " %-1i %4(or (org-entry-get (point) \"CLOCKSUM\") \"0:00\") / %4e ")
                                (tags . " %-1i %4(or (org-entry-get (point) \"CLOCKSUM\") \"0:00\") / %4e ")
                                (search . " %-1i ")))

  (setq org-agenda-category-icon-alist
      `(
        ("Review" ,(list (all-the-icons-material "library_books")) nil nil :ascent center)
        ("Reading" ,(list (all-the-icons-material "library_books")) nil nil :ascent center)
        ("Development" ,(list (all-the-icons-material "computer")) nil nil :ascent center)
        ("Planning" ,(list (all-the-icons-octicon "calendar")) nil nil :ascent center)
        ("Personal" ,(list (all-the-icons-material "person")) nil nil :ascent center)
        ("Misc" ,(list (all-the-icons-octicon "checklist")) nil nil :ascent center)
        ("" ,(list (all-the-icons-material "library_books")) nil nil :ascent center)))
)

(after! org
  (pushnew! org-link-abbrev-alist
            '("rqm" . "https://clm.dgs.com/qm/web/console/System%20Verification%20for%20projects%20and%20products#action=com.ibm.rqm.planning.home.actionDispatcher&subAction=viewTestCase&id=%s")
            '("jira" . "https://jira.kitenet.com/browse/%s"))
  )

(setq org-publish-project-alist '(
                                  ("deft-html"
                                   :base-directory "~/.deft/"
                                   :base-extension  "org"
                                   :publishing-directory "~/html_export/.deft"
                                   :publishing-function org-html-publish-to-html
                                   )
                                  ("deft-media"
                                   :base-directory "~/.deft/media/"
                                   :base-extension "png\\|svg"
                                   :publishing-directory "~/html_export/.deft/media"
                                   :publishing-function org-publish-attachment)
                                  ("deft-docx"
                                   :base-directory "~/.deft/"
                                   :base-extension "org"
                                   :publishing-directory "~/docx_export/.deft/"
                                   :publishing-function org-pandoc-export-to-docx
                                   )))

(use-package! deft
  :defer t
  :init
  (setq deft-directory "~/.deft/"
        deft-use-filter-string-for-filename nil
        deft-use-filename-as-title nil)
  (advice-add #'deft-complete :after '(lambda () (kill-buffer "*Deft*")))
  (map!
   :map deft-mode-map
   :i "C-j" #'evil-next-line
   :i "C-k" #'evil-previous-line))
