config.el

(use-package! zetteldeft
  :defer t
  :commands
  (
   zetteldeft-deft-new-search
   zetteldeft-search-at-point
   zetteldeft-search-current-id
   zetteldeft-follow-link
   zetteldeft-avy-file-search-ace-window
   zetteldeft-avy-link-search
   zetteldeft-avy-tag-search
   zetteldeft-tag-buffer
   zetteldeft-find-file-id-insert
   zetteldeft-find-file-full-title-insert
   zetteldeft-find-file
   zetteldeft-new-file
   zetteldeft-new-file-and-link
   zetteldeft-file-rename
   zetteldeft-count-words
   )
  :init

(map!
 :leader
 :prefix ("d" . "+deft")

 "d"  #'deft
 "D"  #'zetteldeft-deft-new-search
 "R"  #'deft-refresh
 "s"  #'zetteldeft-search-at-point
 "c"  #'zetteldeft-search-current-id
 "f"  #'zetteldeft-follow-link
 "F"  #'zetteldeft-avy-file-search-ace-window
 "l"  #'zetteldeft-avy-link-search
 "t"  #'zetteldeft-avy-tag-search
 "T"  #'zetteldeft-tag-buffer
 "i"  #'zetteldeft-find-file-id-insert
 "I"  #'zetteldeft-find-file-full-title-insert
 "o"  #'zetteldeft-find-file
 "n"  #'zetteldeft-new-file
 "N"  #'zetteldeft-new-file-and-link
 "r"  #'zetteldeft-file-rename
 "x"  #'zetteldeft-count-words
 ;; :desc "deft" "d" #'deft
 ;; :desc "Browse deft directory" "B" (lambda () (interactive) (dired deft-directory))
 ;; :desc "new file" "n" (lambda (str) (interactive (list (read-string "name: "))) (zetteldeft-new-file str t))
 ;; :desc "insert id" "i" #'zetteldeft-find-file-id-insert
 ;; :desc "insert id+title" "I" #'zetteldeft-find-file-full-title-insert
 ;; :desc "follow link" "f" #'zetteldeft-follow-link
 ;; "F" #'zetteldeft-avy-file-search-ace-window
 ;; :desc "avy link search" "l" #'zetteldeft-avy-link-search)
  ))


;;:desc "new file+link" "N" '(zetteldeft-new-file-and-link t))

(use-package! plantuml-mode
  :defer t
  :init
  (setq plantuml-default-exec-mode 'jar
        plantuml-jar-path "~/bin/plantuml.jar"))

(add-to-list 'auto-mode-alist '("\\.err$" . text-mode))
(add-to-list 'auto-mode-alist '("\\.out$" . text-mode))
